
main(){

int a = 10 ;
int b = 2 ;

// 算术运算符   +  -  *  %   ~/ (取整)
    print( a + b);

// 关系运算符   ==   !=   >   <    >=    <=
   print( a==b ) ;

// 逻辑运算符  !  &&   ||

//  赋值运算符
       // 基础赋值运算符    =   ??= (为空就赋值 类似于三元表达式)
          int c = 5 ;
          c ??= 6 ;
          print(c); // 5 因为c不为空 所以不赋值

          int d  ;
          d ??= 7 ;
          print(d); // 7 因为d为空 所以赋值为 7
                     
            
       // 复合赋值运算符    +=  -=  *=  /=  %=   ~/=
          int s = 10 ;
          s += s ;
          print( s ) ;

}

